In [1]:
import pandas as pd

In [5]:
ds = pd.read_csv('../data/pay_server.csv')

In [6]:
ds.head()

,F254,F1056,F1057,F1148,F1032,F1034,F1101,F64,F65,F67,F253,F1036,F1079,F1100,F1765,expire_date,isexpired,Unnamed: 17,Unnamed: 18
0,9/29/2024,450,2,44000351300,200051,7701,0,15,0,0,32:46.1,153135,4058176625,0.0,NaN,NaN,NaN,NaN,NaN
1,10/20/2024,450,23,44000351300,172570,7701,0,17,0,0,58:33.4,125617,4069616481,0.0,NaN,NaN,NaN,NaN,NaN
2,10/31/2024,999,901,44000351300,0,7701,0,-15,0,0,04:52.6,0,expired,NaN,NaN,NaN,NaN,NaN,NaN
3,11/30/2024,999,901,44000351300,0,7701,0,-17,0,0,00:46.5,0,expired,NaN,NaN,NaN,NaN,NaN,NaN
4,12/3/2024,450,10,44000351300,244958,7701,0,34,0,0,02:41.7,135924,4054101473,0.0,NaN,NaN,NaN,NaN,NaN

In [17]:
ds.tail()

,F254,F1056,F1057,F1148,F1032,F1034,F1101,F64,F65,F67,F253,F1036,F1079,F1100,F1765,expire_date,isexpired,Unnamed: 17,Unnamed: 18
42,5/31/2025,999,901,44000351300,0,7701,0,-11,0,0,00:03.4,0,expired,NaN,NaN,NaN,NaN,NaN,723.0
43,6/1/2025,450,10,44000351300,265137,7701,0,13,0,0,22:47.4,152008,4052090641,0.0,NaN,NaN,NaN,NaN,NaN
44,6/1/2025,450,10,44000351300,265137,7801,0,50,0,0,22:47.5,152008,4052090641,0.0,NaN,NaN,NaN,NaN,NaN
45,6/4/2025,450,10,44000351300,265482,7701,0,29,0,0,50:56.7,204834,4052072769,0.0,NaN,NaN,NaN,NaN,NaN
46,6/13/2025,450,10,44000351300,266441,7701,0,35,0,0,29:36.4,132715,4052139121,0.0,NaN,NaN,NaN,NaN,NaN

In [19]:
ds1 = ds[:-7]
ds1.tail()

,F254,F1056,F1057,F1148,F1032,F1034,F1101,F64,F65,F67,F253,F1036,F1079,F1100,F1765,expire_date,isexpired,Unnamed: 17,Unnamed: 18
35,3/16/2025,450,10,44000351300,256586,7801,0,50,0,0,05:23.9,210244,4055300353,0.0,NaN,NaN,NaN,NaN,NaN
36,4/3/2025,450,10,44000351300,258630,7701,0,25,0,0,06:32.3,210430,4055422049,0.0,NaN,NaN,NaN,NaN,NaN
37,4/25/2025,450,10,44000351300,261196,7701,0,36,0,0,07:42.5,130457,4051816449,0.0,NaN,NaN,NaN,NaN,NaN
38,4/25/2025,450,10,44000351300,261196,7801,0,50,0,0,07:42.7,130457,4051816449,0.0,NaN,NaN,NaN,NaN,NaN
39,5/28/2025,450,10,44000351300,264785,7701,0,38,0,0,11:17.0,210758,4051996721,0.0,NaN,NaN,NaN,NaN,1473.0

In [42]:
accrued = ds1[ds['F1034'] == 7701]['F64'].sum()

C:\Users\c5m7b\AppData\Local\Temp\ipykernel_50944\3328609236.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  accrued = ds1[ds['F1034'] == 7701]['F64'].sum()

In [43]:
redeemed = ds1[ds['F1034'] == 7801]['F64'].sum()

C:\Users\c5m7b\AppData\Local\Temp\ipykernel_50944\1798582488.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  redeemed = ds1[ds['F1034'] == 7801]['F64'].sum()

## last true point balance

In [44]:
accrued - redeemed

np.int64(73)

In [16]:
ds['F1034'].unique()

array([7701, 7801])

#### start with 73

In [27]:
73-11+13-50+29+35

89

In [48]:
73+1*(-11)+13-50+29+35

89

In [ ]:
# go backwards
93-35-29+50-13

66

#### start with 85

In [36]:
85+2*(-11)+13-50+29+35

90

In [49]:
dsexp = pd.read_csv('../data/expirations.csv')

In [50]:
dsexp.head()

,id,earned_points,redeemed_points,expired_points,f1148,f254,post_date
0,986209,15,0,15,44000351300,10/31/2024,00:00.0
1,1010683,15,0,15,44000351300,11/1/2024,00:00.0
2,1034565,17,0,17,44000351300,11/30/2024,00:00.0
3,1085367,97,300,0,44000351300,1/31/2025,00:00.0
4,1111051,262,450,0,44000351300,2/28/2025,00:00.0

In [54]:
earned = dsexp['earned_points'].sum()
redeemed = dsexp['redeemed_points'].sum()
expired = dsexp['expired_points'].sum()
print(f'earned: {earned}, redeemed: {redeemed}, expired: {expired}')

earned - redeemed - expired

earned: 843, redeemed: 1400, expired: 69

np.int64(-626)

In [62]:
50+33+23+23-100+27+85+26-150+26+19+25+34+31-100+12+34-50+11-50+34

43

In [63]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   F254         47 non-null     object
 1   F1056        47 non-null     int64
 2   F1057        47 non-null     int64
 3   F1148        47 non-null     int64
 4   F1032        47 non-null     int64
 5   F1034        47 non-null     int64
 6   F1101        47 non-null     int64
 7   F64          47 non-null     int64
 8   F65          47 non-null     int64
 9   F67          47 non-null     int64
 10  F253         47 non-null     object
 11  F1036        47 non-null     int64
 12  F1079        47 non-null     object
 13  F1100        42 non-null     float64
 14  F1765        0 non-null      float64
 15  expire_date  0 non-null      float64
 16  isexpired    0 non-null      float64
 17  Unnamed: 17  0 non-null      float64
 18  Unnamed: 18  3 non-null      float64
dtypes: float64(6), int64(10), object(3)
memory usage: 7.1+ KB

In [64]:
ds['f254'] = pd.to_datetime(ds['F254'])

In [65]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 20 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   F254         47 non-null     object
 1   F1056        47 non-null     int64
 2   F1057        47 non-null     int64
 3   F1148        47 non-null     int64
 4   F1032        47 non-null     int64
 5   F1034        47 non-null     int64
 6   F1101        47 non-null     int64
 7   F64          47 non-null     int64
 8   F65          47 non-null     int64
 9   F67          47 non-null     int64
 10  F253         47 non-null     object
 11  F1036        47 non-null     int64
 12  F1079        47 non-null     object
 13  F1100        42 non-null     float64
 14  F1765        0 non-null      float64
 15  expire_date  0 non-null      float64
 16  isexpired    0 non-null      float64
 17  Unnamed: 17  0 non-null      float64
 18  Unnamed: 18  3 non-null      float64
 19  f254         47 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(6), int64(10), object(3)
memory usage: 7.5+ KB

In [71]:
mask1 = ds['F254'] >='12/1/2024' 
mask2 = ds['f254'] <= '1/31/2025'
ds[mask1 & mask2]

,F254,F1056,F1057,F1148,F1032,F1034,F1101,F64,F65,F67,F253,F1036,F1079,F1100,F1765,expire_date,isexpired,Unnamed: 17,Unnamed: 18,f254
0,9/29/2024,450,2,44000351300,200051,7701,0,15,0,0,32:46.1,153135,4058176625,0.0,NaN,NaN,NaN,NaN,NaN,2024-09-29
4,12/3/2024,450,10,44000351300,244958,7701,0,34,0,0,02:41.7,135924,4054101473,0.0,NaN,NaN,NaN,NaN,NaN,2024-12-03
5,12/13/2024,450,10,44000351300,246414,7701,0,30,0,0,17:12.0,131452,4054189857,0.0,NaN,NaN,NaN,NaN,NaN,2024-12-13
6,12/20/2024,450,10,44000351300,247295,7701,0,33,0,0,42:56.9,93927,4054279729,0.0,NaN,NaN,NaN,NaN,NaN,2024-12-20
7,12/20/2024,450,10,44000351300,247295,7801,0,50,0,0,42:56.9,93927,4054279729,0.0,NaN,NaN,NaN,NaN,NaN,2024-12-20

In [69]:
162-50

112